In [2]:
import os
import pandas as pd
import matplotlib.pyplot as plt

In [4]:
url1 = "https://raw.githubusercontent.com/NYUDataBootcamp"

url2 = "/Materials/master/Data/test.csv"

url  = url1 + url2        # location of the file on the www

In [5]:
url

'https://raw.githubusercontent.com/NYUDataBootcamp/Materials/master/Data/test.csv'

In [6]:
df = pd.read_csv(url)     # read file and assign it to df

In [7]:
df

      name  x1  x2   x3
0     Dave   1   2  3.5
1    Chase   4   3  4.3
2  Spencer   5   6  7.8

In [12]:
df_only2 = pd.read_csv(url, nrows = 3)

df_only2

      name  x1  x2   x3
0     Dave   1   2  3.5
1    Chase   4   3  4.3
2  Spencer   5   6  7.8

In [19]:
df_only = pd.read_csv(url, na_values = range(1,7))

In [20]:
df_only

      name  x1  x2   x3
0     Dave NaN NaN  3.5
1    Chase NaN NaN  4.3
2  Spencer NaN NaN  7.8

In [24]:
df_only.dtypes

name     object
x1      float64
x2      float64
x3      float64
dtype: object

In [25]:
url

'https://raw.githubusercontent.com/NYUDataBootcamp/Materials/master/Data/test.csv'

In [32]:
xurl = 'https://raw.githubusercontent.com/NYUDataBootcamp/Materials/master/Data/test.xlsx'

In [33]:
dfxcel = pd.read_excel(xurl)

In [34]:
dfxcel

      name  x1  x2   x3
0     Dave   1   2  3.5
1    Chase   4   3  4.3
2  Spencer   5   6  7.8

In [37]:
dfxcel.to_excel("myfirst_file.xlsx")

In [38]:
dfxcel.to_csv("myfirst_file.csv")

In [39]:
new_df = pd.read_csv("myfirst_file.csv")

In [40]:
new_df

   Unnamed: 0     name  x1  x2   x3
0           0     Dave   1   2  3.5
1           1    Chase   4   3  4.3
2           2  Spencer   5   6  7.8

In [41]:
my_path = os.getcwd()

my_path

'C:\\GitHub\\data_bootcamp_spring_2019'

In [42]:
new_place = "C:\\GitHub\\myfirst_file.csv"

In [44]:
dfxcel.to_csv(new_place)